nc: 80  # overridden by the VisDrone data yaml during training
scales:
  l: [1.00, 1.00, 1024]
backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4 raw P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]] # 10 Y5
  - [-1, 1, DySample, [2, 'lp']] # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 12
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256, 0.5]] # 14
  - [-1, 1, Conv, [128, 1, 1]] # 15 Y4
  - [-1, 1, DySample, [2, 'lp']] # 16

  # Historical PGDP path is kept layer-for-layer equivalent to the confirmed run.
  - [[4, 5, 6], 1, PGDPEnhance, [64, 1.0, 0.1, 1.0]] # 17 enhanced P2
  - [-1, 1, Focus, [128, 1]] # 18
  - [[-1, 16, 5], 1, Concat, [1]] # 19
  - [-1, 1, MFFF, []] # 20
  - [-1, 3, RepC3, [256, 0.5]] # 21 P3
  - [-1, 1, FrequencyFocusedDownSampling, [256]] # 22
  - [[-1, 15], 1, Concat, [1]] # 23
  - [-1, 3, RepC3, [256, 0.5]] # 24 P4
  - [-1, 1, FrequencyFocusedDownSampling, [256]] # 25
  - [[-1, 10], 1, Concat, [1]] # 26
  - [-1, 3, RepC3, [256, 0.5]] # 27 P5

  # Independent second module: post-fusion FSEM on the completed neck pyramid.
  - [[21, 24, 27], 1, FSEM, [0.1, 0.1, 1.0]] # 28
  - [28, 1, FSEMSelect, [0, 256]] # 29 FSEM P3
  - [28, 1, FSEMSelect, [1, 256]] # 30 FSEM P4
  - [28, 1, FSEMSelect, [2, 256]] # 31 FSEM P5

  - [[29, 31], 1, SemanticAlignmenCalibration, []] # 32 final decoder P3
  - [[32, 30, 31], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
