nc: 80  # number of classes, overridden by data yaml during training
scales:
  l: [1.00, 1.00, 1024]
backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4 raw P2/4
  - [-1, 1, P2InformationEnhance, []] # 5 information-guided P2 enhancement
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 6-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 7-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 8-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0
  - [-1, 1, DySample,  [2, 'lp']] # 12
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 3, RepC3, [256, 0.5]]  # 15, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]   # 16, Y4, lateral_convs.1
  - [-1, 1, DySample,  [2, 'lp']] # 17
  - [5, 1, Focus, [128,1]] # 18 enhanced P2 skip
  - [[-1, -2, 6], 1, Concat, [1]] # 19
  - [-1, 1, MFFF, []] # 20
  - [-1, 3, RepC3, [256, 0.5]] # 21
  - [-1, 1, FrequencyFocusedDownSampling, [256]]   # 22
  - [[-1, 16], 1, Concat, [1]] # 23
  - [-1, 3, RepC3, [256, 0.5]] # 24
  - [-1, 1, FrequencyFocusedDownSampling, [256]]   # 25
  - [[-1, 11], 1, Concat, [1]] # 26
  - [-1, 3, RepC3, [256, 0.5]] # 27
  - [[21, -1], 1, SemanticAlignmenCalibration, []] # 28
  - [-1, 1, NRP3CBAM, []] # 29 P3 small-object enhancement after P2Info neck path
  - [[29, 24, 27], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
