
nc: 80  # number of classes
scales: # 
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, efficientformerv2_s0, []]  # 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 5 input_proj.2 5
  - [-1, 1, AIFI, [1024, 8]] # 6
  - [-1, 1, Conv, [256, 1, 1]]  # 7, Y5, lateral_convs.0 7

  - [-1, 1, DySample,  [2, 'lp']] # 8
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]   # 15, Y4, lateral_convs.1


  - [-1, 1, DySample,  [2, 'lp']] # 16 
  - [1, 1, Focus, [128,1]] # 17
  - [[-1, -2, 2], 1, Concat, [1]] # 18
  - [-1, 1, MFFF, []] # 19
  - [-1, 3, RepC3, [256, 0.5]] # 20

  - [-1, 1, FrequencyFocusedDownSampling, [256]]   # 21
  - [[-1, 12], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [256, 0.5]] # 23
  
  - [-1, 1, FrequencyFocusedDownSampling, [256]]   # 24
  - [[-1, 7], 1, Concat, [1]] # 25
  - [-1, 3, RepC3, [256, 0.5]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 ] # 26
  
  - [[17, -1], 1, SemanticAlignmenCalibration, []] # 27 

  - [[24, 20, 23], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)