nc: 80  # overridden by the VisDrone data yaml during training
scales:
  l: [1.00, 1.00, 1024]
backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4 raw P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, RetrieverDictionary, [512, 0.8]] # 10 dataset-level semantic dictionary
  - [-1, 1, Conv, [256, 1, 1]] # 11 Y5
  - [-1, 1, DySample, [2, 'lp']] # 12
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 3, RepC3, [256, 0.5]] # 15
  - [-1, 1, Conv, [128, 1, 1]] # 16 Y4
  - [-1, 1, DySample, [2, 'lp']] # 17
  - [[4, 5, 6], 1, PGDPEnhance, [64, 1.0, 0.1, 1.0]] # 18 enhanced P2 skip source
  - [-1, 1, Focus, [128, 1]] # 19
  - [[-1, 17, 5], 1, Concat, [1]] # 20
  - [-1, 1, MFFF, []] # 21
  - [-1, 3, RepC3, [256, 0.5]] # 22 decoder P3 source
  - [-1, 1, FrequencyFocusedDownSampling, [256]] # 23
  - [[-1, 16], 1, Concat, [1]] # 24
  - [-1, 3, RepC3, [256, 0.5]] # 25 decoder P4
  - [-1, 1, FrequencyFocusedDownSampling, [256]] # 26
  - [[-1, 11], 1, Concat, [1]] # 27
  - [-1, 3, RepC3, [256, 0.5]] # 28 decoder P5
  - [[22, -1], 1, SemanticAlignmenCalibration, []] # 29 final decoder P3
  - [[29, 25, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
